jonacappelle/nRF52-DCU/BLE_Services/usr_ble.c
void set_config_reset()
{
    imu.gyro_enabled = 0;
    imu.accel_enabled = 0;
    imu.mag_enabled = 0;
    imu.quat6_enabled = 0;
    imu.quat9_enabled = 0;
    imu.euler_enabled = 0;
    imu.frequency = 0;
    imu.sync_enabled = 0;
    imu.stop = 0;
    imu.adc = 0;
    imu.wom = 0;
}

void config_send()
{
    ret_code_t err_code;

    ble_tes_config_t config;
    config.gyro_enabled = imu.gyro_enabled;
    config.accel_enabled = imu.accel_enabled;
    config.mag_enabled = imu.mag_enabled;
    config.euler_enabled = imu.euler_enabled;
    config.quat6_enabled = imu.quat6_enabled;
    config.quat9_enabled = imu.quat9_enabled;
    config.motion_freq_hz = imu.frequency;
    config.wom_enabled = imu.wom;
    config.sync_enabled = imu.sync_enabled;
    config.stop = imu.stop;
    config.adc_enabled = imu.adc;

    // Get timestamp from master
    imu.sync_start_time = ts_timestamp_get_ticks_u64();

    // Send start signal to be 2 seconds later
    imu.sync_start_time = ( TIME_SYNC_TIMESTAMP_TO_USEC(imu.sync_start_time) / 1000 ) + 2000;

    imu.sync_start_time = ( TIME_SYNC_MSEC_TO_TICK(imu.sync_start_time) / 100 ) * 100;


    config.sync_start_time = imu.sync_start_time;
    NRF_LOG_INFO("sync_start_time: %d", imu.sync_start_time);
    

    NRF_LOG_INFO("config.adc_enabled %d", config.adc_enabled);

    NRF_LOG_INFO("config wwwwooommmmm %d", config.wom_enabled);
    NRF_LOG_INFO("imu wwwwooommmmm %d", imu.wom);


    // Send config to peripheral
    usr_ble_config_send(config);
}


ret_code_t imu_disconnect(uint32_t conn_handle_num)
{
    ret_code_t err_code;

    // Disconnect IMU's
    err_code = sd_ble_gap_disconnect(conn_handle_num, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if(err_code == BLE_ERROR_INVALID_CONN_HANDLE)
    {
        NRF_LOG_INFO("BLE_ERROR_INVALID_CONN_HANDLE");
    }
    
    if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != BLE_ERROR_INVALID_CONN_HANDLE) )
    {
        APP_ERROR_CHECK(err_code);
    }
    NRF_LOG_INFO("IMU Disconnected");

    return err_code;
}
